Repository: Centaur/lua-nginx-module
Catalog: omegat/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Similarly, if only [[#content_by_lua|content_by_lua]] is specified, the request body will not be read until the content handler's Lua code is about to run (i.e., the request body will be read during the content phase).
zh_cn: 类似的，, 如果只设置了 [[#content_by_lua|content_by_lua]] , 请求体将在进行内容处理Lua 代码将要运行时被读取 (即, 请求体将在content阶段被读取).

source: Similarly, if using the standard Lua 5.1 interpreter with ngx_lua, Lua compatible bytecode files must be generated using the <code>luac</code> commandline utility as shown:
zh_cn: 类似的, 如果在ngx_lua中使用标准Lua 5.1, 要象下面这样用<code>luac</code>生成兼容的字节码文件:

source: Similarly, the following directives provided by [[HttpEncryptedSessionModule]] can be invoked from within Lua too:
zh_cn: 类似的, 也可以在Lua中调用 [[HttpEncryptedSessionModule]]提供的命令:

source: Since <code>v0.8.3</code> this function returns <code>1</code> on success, or returns <code>nil</code> and a string describing the error otherwise.
zh_cn: 从<code>v0.8.3</code> 版本开始这个函数成功时返回 <code>1</code> , 出错时 returns <code>nil</code> 和 描述错误的字符串.

source: Since the <code>0.6.9</code> release, all the header names in the Lua table returned are converted to the pure lower-case form by default, unless the <code>raw</code> argument is set to <code>true</code> (default to <code>false</code>).
zh_cn: 从<code>0.6.9</code>版本开始, 默认Lua table中的所有头名称将被转换成纯小写，除非 <code>raw</code> 参数被设为 <code>true</code> (默认为<code>false</code>).

source: Since the <code>0.7.20</code> release, The <code>0</code> time argument can also be specified.
zh_cn: 从<code>0.7.20</code> 版本起, 支持 <code>0</code> 作为时间参数.

source: Since the <code>v0.7.18</code> release, connecting to a datagram unix domain socket file is also possible on Linux:
zh_cn: 从 <code>v0.7.18</code> 版本开始, 也可以连接到Linux上的数据报unix domain socket 文件:

source: Sleeps for the specified seconds without blocking.
zh_cn: 非阻塞地睡眠指定的时间.

source: So
zh_cn: 所以

source: So be careful when calling either of these two in a tight loop; buffer the data yourself in Lua and save the calls.
zh_cn: 所以如果在循环中调用它们时要小心，请自行缓冲数据以减少调用次数.

source: So ensure that the [[EventsModule#worker_connections|worker_connections]] directive is set to a large enough value that takes into account both the real connections and fake connections required by timer callbacks (as limited by the [[#lua_max_running_timers|lua_max_running_timers]] directive).
zh_cn: 所以要确保 [[EventsModule#worker_connections|worker_connections]] 命令设置得足够大, 同时考虑定时器回调函数(由 [[#lua_max_running_timerslua_max_running_timers]] 命令设置)所需要的真实连接和假连接的数量.

source: So even <code>1</code> byte buffer size should still work everywhere but the performance could be terrible.
zh_cn: 所以即使是 <code>1</code> 字节的缓冲区大小也可以工作，只是性能会很糟糕。

source: So for the example above, if the incoming data stream is <code>'hello, world!
zh_cn: 所以在上面的例子中, 如果输入数据流是 <code>'hello, world!

source: So if using LuaJIT 2.0 with ngx_lua, LuaJIT compatible bytecode files must be generated as shown:
zh_cn: 所以如果在ngx_lua中使用 LuaJIT 2.0, 需要这样生成LuaJIT兼容的字节码:

source: So if you do ''not'' want to re-initialize the shm storage in your <code>init_by_lua</code> code in this case, then you just need to set a custom flag in the shm storage and always check the flag in your <code>init_by_lua</code> code.
zh_cn: 所以如果在这种情况下如果你不希望在<code>init_by_lua</code>代码中重新对共享存储进行初始化，你只需要在共享存储中设置一个标记，并在 <code>init_by_lua</code> 代码中检查这个标记.

source: So it is also prohibited to abort a running "light thread" that is pending on one ore more Nginx subrequests.
zh_cn: 所以也禁止中断一个与一个或多个Nginx子请求绑定的正在运行的 "轻量线程" .

source: So objects with the same lifetime as the request creating them, like [[#ngx.socket.tcp|cosockets]], cannot be shared between the original request and the timer user callback function.
zh_cn: 所以，与创建它们的请求具有相同生命周期的对象，如 [[#ngx.socket.tcp|cosockets]], 不能在原始请求与定时器用户回调函数之间共享.

source: So one will get Lua exception for accessing the <code>nil</code> value.
zh_cn: 这样就会因为获取不到模块导致Lua异常.

source: So the following snippet will not work as expected:
zh_cn: 所以下面的代码无法正常运行:

source: So the following will work as expected:
zh_cn: 以下代码会得到预期的结果:

source: So this method can also be used to determine if the current connection comes from the pool.
zh_cn: 所以此方法也可以用来确定当前连接是否是从池中来的.

source: So when a HTTP 1.0 request is made and the [[#lua_http10_buffering|lua_http10_buffering]] directive is turned <code>on</code>, ngx_lua will buffer the output of [[#ngx.say|ngx.say]] and [[#ngx.print|ngx.print]] calls and also postpone sending response headers until all the response body output is received.
zh_cn: 所以如果是HTTP 1.0请求而且[[#lua_http10_buffering|lua_http10_buffering]] 命令被置为 <code>on</code>, ngx_lua 将会缓存把 [[#ngx.say|ngx.say]] 和[[#ngx.print|ngx.print]] 的输出，并延迟发送响应头，直到得到所有的响应体.

source: So when you need to read from an Nginx variable repeatedly in your Lua code, cache the Nginx variable value to your own Lua variable, for example,
zh_cn: 所以如果在Lua代码中需要多次读取一个Nginx变量, 请将Nginx变量的值赋给你自己的Lua变量, 例如,

source: Socket objects that have not invoked this method (and associated connections) will be closed when the socket object is released by the Lua GC (Garbage Collector) or the current client HTTP request finishes processing.
zh_cn: 没有调用此方法的Socket对象 (及相关的连接) 会被Lua GC或当前客户端HTTP请求结束处理过程释放.

source: Some distribution package managers also distribute LuajIT and/or Lua.
zh_cn: 有一些发行版包管理器也发布 LuajIT 和/或 Lua.

source: Some special nginx variables like <code>$args</code> and <code>$limit_rate</code> can be assigned a value, some are not, like <code>$arg_PARAMETER</code>.
zh_cn: 有些nginx变量，如 <code>$args</code> 和 <code>$limit_rate</code> 可以被设值, 有些则不行, 如 <code>$arg_PARAMETER</code>.

source: Spawns a new user "light thread" with the Lua function <code>func</code> as well as those optional arguments <code>arg1</code>, <code>arg2</code>, and etc.
zh_cn: 使用Lua函数<code>func</code>及可选参数<code>arg1</code>, <code>arg2</code>等创建一个新的用户"轻量线程".

source: Specifies the "match limit" used by the PCRE library when executing the [[#ngx.re.match|ngx.re API]].
zh_cn: 指定在执行[[#ngx.re.matchngx.re API]]时PCRE库所使用的 "match limit" 参数。

source: Specifies the buffer size used by cosocket reading operations.
zh_cn: 指定cosocket读操作的缓冲区大小。

source: Specifies the maximum number of entries allowed in the worker process level compiled regex cache.
zh_cn: 设置在worker进程级别允许缓存的编译后正则表达式的条数

source: Specifies the size limit (in terms of connection count) for every cosocket connection pool associated with every remote server (i.e., identified by either the host-port pair or the unix domain socket file path).
zh_cn: 指定与每个远程服务器(由主机-端口号或unix domain socket文件路径标识)所关联的每个cosocket连接池的大小（连接数）上限。

source: Specify <code>options</code> to control how the match operation will be performed.
zh_cn: 指定<code>options</code> 选项来控制如何进行匹配.

source: Strings like <code>"GET"</code> and <code>"POST"</code> are returned instead of numerical [[#HTTP method constants|method constants]].
zh_cn: 返回值是如<code>"GET"</code> 和 <code>"POST"</code> 这样的字符串而不是数字 [[#HTTP method constants|方法常量]].

source: Subrequests are completely different from HTTP 301/302 redirection (via [[#ngx.redirect|ngx.redirect]]) and internal redirection (via [[#ngx.exec|ngx.exec]]).
zh_cn: 子请求与 HTTP 301/302 重定向(通过 [[#ngx.redirect|ngx.redirect]]) 和 内部重定向 (通过[[#ngx.exec|ngx.exec]]) 是完全不同的.

source: Substitutes the first match of the Perl compatible regular expression <code>regex</code> on the <code>subject</code> argument string with the string or function argument <code>replace</code>.
zh_cn: 将 Perl 兼容的正则表达式 <code>regex</code> 对 <code>subject</code> 字符串参数的第一个匹配替换为字符串或函数参数 <code>replace</code>.

source: Such boilerplate "light thread" are also called "entry threads".
zh_cn: 这个标准"轻量线程"也称为"入口线程".

source: That is, if a client IP address is in the blacklist, it will be denied before the MySQL query for more complex authentication is executed by [[#access_by_lua|access_by_lua]].
zh_cn: 如果客户端的IP地址在黑名单中，则请求将在[[#access_by_luaaccess_by_lua]]进行MySQL查询进行更复杂的认证之前被拒绝。

source: That is, it will read that <code>size</code> of data on each invocation and will return <code>nil</code> at the last invocation (either sees the boundary pattern or meets an error).
zh_cn: 对它的每次调用都会读取 <code>size</code> 字节的数据，最后一次调用（遇到边界模式或出错）返回 <code>nil</code> .

source: That is, nginx variables cannot be created on-the-fly.
zh_cn: 也就是说，nginx变量不能随需创建.

source: That is, one should ''not'' assign it to a variable belonging to persistent namespace like a Lua package.
zh_cn: 也就是说， ''不要'' 把它赋值给一个属于持久命名空间如Lua package的变量.

source: That is, the <code>ngx.ctx.foo</code> entry persists across the rewrite, access, and content phases of a request.
zh_cn: 这说明 <code>ngx.ctx.foo</code> 在请求的rewrite, access, 和 content各个阶段都有效。

source: That is, they will take Lua boolean values <code>true</code>.
zh_cn: 即他们的值为 boolean 值<code>true</code>.

source: That is, when the body filter sees a chunk containing the word "hello", then it will set the "eof" flag to true immediately, resulting in truncated but still valid responses.
zh_cn: 当过滤器看到包含 "hello" 的数据块, 就立即将 "eof" 标记设为true, 产生被截断但仍然是有效的响应内容。

source: That is, when there are multiple nginx worker processes under an Nginx master, data sharing cannot cross the process boundary between these workers.
zh_cn: 也就是说，如果在Nginx master下有多个nginx worker进程，数据共享不会跨越这些worker之间的进程边界.

source: The "light threads" are not scheduled in a pre-emptive way.
zh_cn: "轻量线程"的调度是抢占式的.

source: The "match table" fed into the <code>replace</code> function is exactly the same as the return value of [[#ngx.re.match|ngx.re.match]].
zh_cn: <code>replace</code> 函数的 <code>replace</code> 参数与 [[#ngx.re.match|ngx.re.match]] 的返回值完全一样.

source: The "parent coroutine" can call [[#ngx.thread.wait|ngx.thread.wait]] to wait on the termination of its child "light thread".
zh_cn: "父coroutine" 可以调用 [[#ngx.thread.wait|ngx.thread.wait]] 来等待子 "轻量线程" 结束.

source: The "pending timers" here mean timers that have not yet been expired and "running timers" are those whose user callbacks are currently running.
zh_cn: "等待中的定时器" 指尚未到期的定时器 "运行中的定时器" 指其user回调函数当前正在运行的定时器.

source: The <code>-bg</code> option can be used to include debug information in the LuaJIT bytecode file:
zh_cn: 可以用 <code>-bg</code> 选项在LuaJIT字节码文件中包含调试信息:

source: The <code><size></code> argument accepts size units such as <code>k</code> and <code>m</code>:
zh_cn: <code><size></code> 参数支持象 <code>k</code> 和 <code>m</code>这样的大小单位:

source: The <code><time></code> argument can be an integer, with an optional time unit, like <code>s</code> (second), <code>ms</code> (millisecond), <code>m</code> (minute).
zh_cn: <code><time></code> 参数可以是整数，时间单位可选, 如<code>s</code> (秒), <code>ms</code> (毫秒), <code>m</code> (分钟).

source: The <code>[=[...]=]</code> form may be used as the default form if desired.
zh_cn: 如果需要可以将 <code>[=[...]=]</code> 作为默认的正则书写形式.

source: The <code>__index</code> metamethod will not be added when the <code>raw</code> argument is set to <code>true</code>.
zh_cn: 如果<code>raw</code>参数被设为<code>true</code>，则不会添加 <code>__index</code> 元方法。

source: The <code>args</code> argument can be either a Lua string, as in
zh_cn: <code>args</code> 参数可以是 Lua 字符串, 如

source: The <code>args</code> option can also take plain query strings:
zh_cn: <code>args</code> 选项也可以直接使用 query string字符串:

source: The <code>args</code> option can specify extra URI arguments, for instance,
zh_cn: <code>args</code> 选项可以用来指定其它的 URI 参数, 例如,

source: The <code>args</code>, <code>vars</code>, or <code>copy_all_vars</code> options are generally preferable instead.
zh_cn: 更推荐使用 <code>args</code>, <code>vars</code>, 或 <code>copy_all_vars</code> 这些选项.

source: The <code>auto_clean</code> is default to <code>false</code>.
zh_cn: <code>auto_clean</code> 默认为 <code>false</code>.

source: The <code>copy_all_vars</code> option provides a copy of the parent request's Nginx variables to subrequests when such subrequests are issued.
zh_cn: <code>copy_all_vars</code> 在发起子请求时为子请求提供父请求Nginx变量的拷贝。

source: The <code>ctx</code> option can be used to specify a custom Lua table to serve as the [[#ngx.ctx|ngx.ctx]] table for the subrequest.
zh_cn: <code>ctx</code> 选项用来为子请求指定自定义的 [[#ngx.ctx|ngx.ctx]] table 。

source: The <code>ctx</code> table argument combined with the <code>a</code> regex modifier can be used to construct a lexer atop <code>ngx.re.match</code>.
zh_cn: 使用<code>ctx</code> 参数和 <code>a</code> 正则修饰符的组合可以在 <code>ngx.re.match</code> 基础上实现词法分析器.

source: The <code>header_value</code> can take an array list of values, for example,
zh_cn: <code>header_value</code> 可以接受一个数组存放多个值, 例如,

source: The <code>inclusive</code> takes a boolean value to control whether to include the pattern string in the returned data string.
zh_cn: <code>inclusive</code> 是一个布尔值，用来控制在返回的数据字符串中是否包括模式串.

source: The <code>jump</code> can only be set to <code>true</code> in [[#rewrite_by_lua|rewrite_by_lua]] and [[#rewrite_by_lua_file|rewrite_by_lua_file]].
zh_cn: <code>jump</code> 只能在[[#rewrite_by_luarewrite_by_lua]] 和 [[#rewrite_by_lua_filerewrite_by_lua_file]]中被设为 <code>true</code>.

source: The <code>log_level</code> argument can take constants like <code>ngx.ERR</code> and <code>ngx.WARN</code>.
zh_cn: <code>log_level</code> 参数可以是象<code>ngx.ERR</code> <code>ngx.WARN</code>这样的常量.

source: The <code>method</code> option is <code>ngx.HTTP_GET</code> by default.
zh_cn: 默认的 <code>method</code> 选项是 <code>ngx.HTTP_GET</code> .

source: The <code>mydata</code> module in this example will only be loaded and run on the first request to the location <code>/lua</code>, and all subsequent requests to the same nginx worker process will use the reloaded instance of the module as well as the same copy of the data in it, until a <code>HUP</code> signal is sent to the Nginx master process to force a reload.
zh_cn: 本例中的 <code>mydata</code> 模块代码仅在第一个对<code>/lua</code>的请求中加载，然后运行, 所有对同一个nginx worker进程的后续请求将使用这个模块的同一个实例，包括其中的数据，直到向Nginx master进程发送 <code>HUP</code> 信号强制重新加载配置.

source: The <code>ngx.DECLINED</code> constant was first introduced in the <code>v0.5.0rc19</code> release.
zh_cn: <code>ngx.DECLINED</code> 常量在 <code>v0.5.0rc19</code> 版本中引入.

source: The <code>ngx.null</code> constant is a <code>NULL</code> light userdata usually used to represent nil values in Lua tables etc and is similar to the [http://www.kyne.com.au/~mark/software/lua-cjson.php lua-cjson] library's <code>cjson.null</code> constant.
zh_cn: <code>ngx.null</code> 常量是一个 <code>NULL</code> 轻量 userdata，通常用于表示Lua table等中的nil值，类似于 [http://www.kyne.com.au/~mark/software/lua-cjson.php lua-cjson] 库的<code>cjson.null</code> 常量.

source: The <code>ngx.null</code> constant will yield the <code>"null"</code> string output.
zh_cn: <code>ngx.null</code> 常量输出为 <code>"null"</code> 字符串.

source: The <code>o</code> option is useful for performance tuning, because the regex pattern in question will only be compiled once, cached in the worker-process level, and shared among all requests in the current Nginx worker process.
zh_cn: <code>o</code> 选项对性能调优很有用，因为正则模板只编译一次，在worker进程级别进行缓存，被当前Nginx worker进程的所有请求所共享.

source: The <code>rewrite_by_lua</code> code will always run at the end of the <code>rewrite</code> request-processing phase unless [[#rewrite_by_lua_no_postpone|rewrite_by_lua_no_postpone]] is turned on.
zh_cn: 除非[[#rewrite_by_lua_no_postpone|rewrite_by_lua_no_postpone]]被设成on， <code>rewrite_by_lua</code>总是在<code>rewrite</code>请求处理阶段的最后执行。

source: The <code>rewrite_by_lua_file</code> code will always run at the end of the <code>rewrite</code> request-processing phase unless [[#rewrite_by_lua_no_postpone|rewrite_by_lua_no_postpone]] is turned on.
zh_cn: 除非[[#rewrite_by_lua_no_postpone|rewrite_by_lua_no_postpone]]被设成on， <code>rewrite_by_lua_file</code>总是在<code>rewrite</code>请求处理阶段的最后执行。

source: The <code>share_all_vars</code> option controls whether to share nginx variables among the current request and its subrequests.
zh_cn: <code>share_all_vars</code>选项控制是否将本请求中的Nginx变量值与子请求共享。

source: The <code>status</code> argument can be <code>ngx.OK</code>, <code>ngx.ERROR</code>, <code>ngx.HTTP_NOT_FOUND</code>, <code>ngx.HTTP_MOVED_TEMPORARILY</code>, or other [[#HTTP status constants|HTTP status constants]].
zh_cn: <code>status</code> 参数可以是<code>ngx.OK</code>, <code>ngx.ERROR</code>, <code>ngx.HTTP_NOT_FOUND</code>, <code>ngx.HTTP_MOVED_TEMPORARILY</code>, 或其它[[#HTTP status constants|HTTP状态常量]].

source: The <code>uri</code> argument must be a Lua string and cannot be of zero length, or a Lua exception will be thrown.
zh_cn: <code>uri</code> 参数必须是一个Lua string，长度必须大于0，不然会抛出Lua异常.

source: The <code>value</code> argument can be any valid Lua numbers, like negative numbers or floating-point numbers.
zh_cn: <code>value</code> 参数可以是任何有效的 Lua 数值, 如负数或浮点数.

source: The <code>value</code> argument inserted can be Lua booleans, numbers, strings, or <code>nil</code>.
zh_cn: 被插入的 <code>value</code> 参数可以是 Lua布尔值, 数字，字符串, 或r <code>nil</code>.

source: The API is exposed to Lua in the form of two standard packages <code>ngx</code> and <code>ndk</code>.
zh_cn: 这套API是以两个标准包 <code>ngx</code> and <code>ndk</code> 的形式暴露给Lua的.

source: The CR and LF characters are not included in the returned line.
zh_cn: 在返回的行文本中不包括回车和换行.

source: The HTTP 1.0 protocol does not support chunked output and requires an explicit <code>Content-Length</code> header when the response body is not empty in order to support the HTTP 1.0 keep-alive.
zh_cn: HTTP 1.0 协议不支持分块输出， 要支持HTTP 1.0 keep-alive，在响应体非空时，在响应头中需要显式地提供<code>Content-Length</code>.

source: The Lua code cache can be temporarily disabled during development by switching [[#lua_code_cache|lua_code_cache]] <code>off</code> in <code>nginx.conf</code> to avoid reloading Nginx.
zh_cn: 在开发阶段，Lua代码缓存可以通过在<code>nginx.conf</code>中设置 [[#lua_code_cache|lua_code_cache]] <code>off</code> 来避免重新加载Nginx配置文件。

source: The Lua code cache can be temporarily disabled during development by switching [[#lua_code_cache|lua_code_cache]] <code>off</code> in <code>nginx.conf</code> to avoid repeatedly reloading Nginx.
zh_cn: 在开发阶段，Lua代码缓存可以通过在<code>nginx.conf</code>中设置 [[#lua_code_cache|lua_code_cache]] <code>off</code> 来避免重新加载Nginx配置文件。

source: The Lua code can pass its own modified version of the input data chunk to the downstream Nginx output body filters by overriding [[#ngx.arg|ngx.arg]][1] with a Lua string or a Lua table of strings.
zh_cn: Lua 代码可以修改 [[#ngx.arg|ngx.arg]][1] 将自己修改后的输入数据块作为Lua string或装有string的Lua table送到下游的Nginx输出体过滤器中。

source: The Lua code may make [[#Nginx API for Lua|API calls]] and is executed as a new spawned coroutine in an independent global environment (i.e. a sandbox).
zh_cn: Lua代码可以调用 [[#Nginx API for Lua|API]] 并以一个拥有独立的全局环境的新生成的coroutine（即一个sandbox）的形式运行.

source: The Lua files referenced in [[#set_by_lua_file|set_by_lua_file]], [[#content_by_lua_file|content_by_lua_file]], [[#access_by_lua_file|access_by_lua_file]], and [[#rewrite_by_lua_file|rewrite_by_lua_file]] will not be cached and the Lua <code>package.loaded</code> table will be cleared at the entry point of every request (such that Lua modules will not be cached either).
zh_cn: 在[[#set_by_lua_file|set_by_lua_file]], [[#content_by_lua_file|content_by_lua_file]], [[#access_by_lua_file|access_by_lua_file]], 和 [[#rewrite_by_lua_file|rewrite_by_lua_file]]中引用的Lua文件不会被缓存， Lua的 <code>package.loaded</code> table会在每个请求的入口被清空 (所以 Lua 模块也不会被缓存).

source: The Lua interpreter or LuaJIT instance is shared across all the requests in a single nginx worker process but request contexts are segregated using lightweight Lua coroutines.
zh_cn: 在单个nginx worker进程中Lua解释器或LuaJIT实例为所有请求所共享，但是请求上下文使用了轻量的Lua coroutine进行了隔离。

source: The Lua module is actually loaded by the first Nginx request handler and is cached by the <code>require()</code> built-in in the package.loaded table for later reference, and <code>require()</code> has the side effect of setting a global variable to the loaded module table.
zh_cn: Lua模块是由第一个Nginx请求处理器加载的，由内置的<code>require()</code>缓存在package.loaded table中，供后续使用, <code>require()</code> 有一个副作用，会在加载的模块table中设置一个全局变量.

source: The Lua state (Lua VM instance) is shared across all the requests handled by a single nginx worker process to minimize memory use.
zh_cn: Lua状态 (Lua虚拟机实例) 在同一个nginx worker进程中被所有请求共享以减少内存占用.

source: The Nginx Lua API described below can only be called within the user Lua code run in the context of these configuration directives.
zh_cn: 以下的 Nginx Lua API 只能由运行在这些配置命令上下文中的Lua代码进行调用。

source: The Nginx core does not read the client request body by default and if request body data is required, then this directive should be turned <code>on</code> or the [[#ngx.req.read_body|ngx.req.read_body]] function should be called within the Lua code.
zh_cn: Nginx内核默认不读取请求体，如果需要请求体数据, 就需要将本命令置为 <code>on</code> ，或者在Lua代码中调用 [[#ngx.req.read_body|ngx.req.read_body]] 函数.

source: The [[#ngx.location.capture|ngx.location.capture]] function is just a special form of this function.
zh_cn: [[#ngx.location.capture|ngx.location.capture]] 函数只是本函数的特殊形式

source: The [http://openresty.org ngx_openresty bundle] can be used to install Nginx, ngx_lua, either one of the standard Lua 5.1 interpreter or LuaJIT 2.0, as well as a package of powerful companion Nginx modules.
zh_cn: [http://openresty.org ngx_openresty 包] 可以用来安装Nginx, ngx_lua, 标准 Lua 5.1 解释器或 LuaJIT 2.0, 以及一堆强大的Nginx模块.

source: The [https://groups.google.com/group/openresty openresty] mailing list is for Chinese speakers.
zh_cn: [https://groups.google.com/group/openresty openresty].

source: The [https://groups.google.com/group/openresty-en openresty-en] mailing list is for English speakers.
zh_cn: [https://groups.google.com/group/openresty-en openresty-en]

source: The ability to require these packages was introduced in the <code>v0.2.1rc19</code> release.
zh_cn: require 这两个包的能力始于 <code>v0.2.1rc19</code> 版本.

source: The arguments <code>thread1</code>, <code>thread2</code>, and etc are the Lua thread objects returned by earlier calls of [[#ngx.thread.spawn|ngx.thread.spawn]].
zh_cn: 参数<code>thread1</code>, <code>thread2</code>, 等是由之前[[#ngx.thread.spawnngx.thread.spawn]]调用返回的Lua线程对象.

source: The basic installation step is a simple <code>./configure --with-luajit && make && make install</code>.
zh_cn: 基本安装过程是 <code>./configure --with-luajit && make && make install</code>.

source: The callback function can decide what to do with the client abortion event all by itself.
zh_cn: 此回调函数可以完全自主地决定如何处理客户端中断事件.

source: The changes of every release of this module can be obtained from the ngx_openresty bundle's change logs:
zh_cn: 本模块的每次版本发布的变动信息可以从 ngx_openresty 发布包中的变动日志中获得:

source: The code in <code><lua-script-str></code> can make [[#Nginx API for Lua|API calls]] and can retrieve input arguments from the <code>ngx.arg</code> table (index starts from <code>1</code> and increases sequentially).
zh_cn: <code><lua-script-str></code>中的代码可以调用 [[#Nginx API for Lua|API]]并能从 <code>ngx.arg</code> table中获取输入参数 (下标从 <code>1</code>开始递增).

source: The code repository of this project is hosted on github at [http://github.com/chaoslawful/lua-nginx-module chaoslawful/lua-nginx-module].
zh_cn: 本项目的代码托管在github [http://github.com/chaoslawful/lua-nginx-module chaoslawful/lua-nginx-module].

source: The contents in the dictionary storage will be lost, however, when the Nginx server quits.
zh_cn: 但是如果Nginx服务器退出了，此字典数据就没有了。

source: The coroutine (be it a normal Lua coroutine or a "light thread") that directly spawns the "light thread" is called the "parent coroutine" for the "light thread" newly spawned.
zh_cn: 直接派生出"轻量线程"的这个 coroutine (可能是普通的Lua coroutine 或 "轻量线程") 称为被创建"轻量线程"的 "父coroutine" .

source: The correct adding order is:
zh_cn: 正确的加载次序是:

source: The cpath string is in standard Lua cpath form, and <code>;;</code> can be used to stand for the original cpath.
zh_cn: cpath字符串使用标准的Lua cpath格式， <code>;;</code> 可用来表示原始的cpath.

source: The current implementation requires that the iterator returned should only be used in a single request.
zh_cn: 目前的实现要求返回的iterator只能用于一个请求.
